vlm/base/DataProcessors/бит_АРМПеремаркировкаОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_АРМПеремаркировкаОстатков</Name>
			<Comment>ЛТ_БН</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

vlm/base/Documents/РасходныйОрдерНаТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РасходныйОрдерНаТовары</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыКОтгрузке</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияСерийТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКОтбору</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВсегоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаданиеНаПеревозку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контролер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтгрузкаПоЗаданиюНаПеревозку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтправительПолучательТоваров</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимПросмотраПоТоварам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладскаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СкладскиеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРасходныхОрдеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бит_КоличествоМест</Name>
					<Comment>ЛТ 2.4</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварыПоРаспоряжениям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Распоряжение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаОтгрузку</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтгружаемыеТовары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоУпаковочныйЛист</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УпаковочныйЛистРодитель</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УпаковочныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УпаковочныйЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УпаковочныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДействияСоСтрокамиОрдеровНаОтгрузку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШтрихкодыУпаковок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШтрихкодУпаковки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/base/DataProcessors/бит_АРМПеремаркировкаОстатков/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьТаблицуДокументыПеремаркировкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	ЗаполнитьТаблицуСерийДляПеремаркировки()
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	//ЗаполнитьТаблицуСерийДляПеремаркировки()
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	ЗаполнитьТаблицуСерийДляПеремаркировки(Истина, ВыбранноеЗначение, Номенклатура)
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьТаблицуСерийДляПеремаркировки();
	ЗаполнитьТаблицуДокументыПеремаркировкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуСерийДляПеремаркировки(ЭтоИзменениеНоменклатуры = Ложь, ВыбраннаяНоменклатура = Неопределено, СтараНоменклатура = Неопределено)
	
	Если ЗначениеЗаполнено(Склад) 
		И ЗначениеЗаполнено(Номенклатура) Тогда
	
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ЭтоИзменениеНоменклатуры", ЭтоИзменениеНоменклатуры);
		СтруктураПараметров.Вставить("ВыбраннаяНоменклатура", ВыбраннаяНоменклатура);
		СтруктураПараметров.Вставить("СтараНоменклатура", СтараНоменклатура);
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьТаблицуСерийДляПеремаркировкиЗавершение", ЭтотОбъект, СтруктураПараметров); 
		ПоказатьВопрос(ОписаниеОповещения, "Заполнить таблицу серий для перемаркировки?", РежимДиалогаВопрос.ДаНет);
	
	КонецЕсли;
	
КонецПроцедуры 
 
&НаКлиенте
Процедура ЗаполнитьТаблицуСерийДляПеремаркировкиЗавершение(РезультатВопроса, СтруктураПараметров) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		Если СтруктураПараметров.ЭтоИзменениеНоменклатуры Тогда
			Номенклатура = СтруктураПараметров.ВыбраннаяНоменклатура;		
		КонецЕсли;
		
		СерииДляПеремаркировки.Очистить();		
		ЗаполнитьТаблицуСерийДляПеремаркировкиНаСервере();
		
	ИначеЕсли СтруктураПараметров.ЭтоИзменениеНоменклатуры Тогда
		
		Номенклатура = СтруктураПараметров.СтараНоменклатура;
		
	КонецЕсли;
	
КонецПроцедуры				

&НаСервере
Процедура ЗаполнитьТаблицуДокументыПеремаркировкиНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводствоБезЗаказа.Ссылка КАК ДокументСсылка
		|ИЗ
		|	Документ.ПроизводствоБезЗаказа КАК ПроизводствоБезЗаказа
		|ГДЕ
		|	ПроизводствоБезЗаказа.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ПроизводствоБезЗаказа.Проведен
		|	И ПроизводствоБезЗаказа.бит_Перемаркировка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПроизводствоБезЗаказа.Дата";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоГода(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецГода(ТекущаяДатаСеанса()));
	
	СписокДокументовПеремаркировки.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСерийДляПеремаркировкиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка,
		|	ТоварыВЯчейкахОстатки.Серия КАК Серия,
		|	ТоварыВЯчейкахОстатки.Назначение КАК Назначение,
		|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК Количество,
		|	ТоварыВЯчейкахОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТоварыВЯчейкахОстатки.Серия.бит_ТипТары КАК Тара,
		|	ТоварыВЯчейкахОстатки.Серия.бит_МассаНетто КАК МассаНетто
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Остатки(
		|			&Дата,
		|			Номенклатура = &Номенклатура
		|				И Ячейка.Владелец = &Склад
		|				И Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК ТоварыВЯчейкахОстатки";
	
	Запрос.УстановитьПараметр("Дата", КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	СерииДляПеремаркировки.Загрузить(Запрос.Выполнить().Выгрузить());	
	
	ИтогКоличество = 0;
	ИтогМассаНетто = 0;
	
	Для Каждого СтрокаТЗ Из СерииДляПеремаркировки Цикл
		ИтогКоличество = ИтогКоличество + СтрокаТЗ.Количество;
		ИтогМассаНетто = ИтогМассаНетто + СтрокаТЗ.МассаНетто;
	КонецЦикла;
	
	Элементы.СерииДляПеремаркировкиКоличество.ТекстПодвала = Формат(ИтогКоличество, "ЧДЦ=3");
	Элементы.СерииДляПеремаркировкиМассаНетто.ТекстПодвала = Формат(ИтогМассаНетто, "ЧДЦ=3");
	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Отметка", Истина);
	
	НайденныеСтроки = СерииДляПеремаркировки.НайтиСтроки(ПараметрыОтбора);
	КоличествоВыбранныхСтрок = НайденныеСтроки.Количество();
	
	ОдинаковыеНазанчения = Истина;
	
	Если КоличествоВыбранныхСтрок <> 0 Тогда
		
		ВыбранноеНазанчение = НайденныеСтроки[0].Назначение;
		
		Для Каждого СтрокаНайденныеСтроки Из НайденныеСтроки Цикл
			
			Если ВыбранноеНазанчение <> СтрокаНайденныеСтроки.Назначение Тогда
				
				ОдинаковыеНазанчения = Ложь;
				Прервать;				
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Номенклатура)
		И ЗначениеЗаполнено(Склад)
		И ЗначениеЗаполнено(НоваяНоменклатура) 
		И ЗначениеЗаполнено(КоличествоВыбранныхСтрок)
		И ОдинаковыеНазанчения Тогда
		
		СтруктураПараметров = Новый Структура;
		ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьДокументыПеремаркировкиЗавершение", ЭтотОбъект, СтруктураПараметров); 
		ПоказатьВопрос(ОписаниеОповещения, "Создать документы перемаркировки?", РежимДиалогаВопрос.ДаНет);
		
	ИначеЕсли НЕ ОдинаковыеНазанчения Тогда
		
		Сообщить("Не совпадают назначения в выбранных строках!");
		
	Иначе
		
		Сообщить("Переход невозможен. Проверьте заполнение обязательных полей ""Склад"", ""Номенклатура"", ""Новая номенклатура"", выберите хотя бы одну серию для перемаркировки в табличной части.");	
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыПеремаркировкиЗавершение(РезультатВопроса, СтруктураПараметров) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
						
		СоздатьДокументыПеремаркировкиНаСервере();
		СерииДляПеремаркировки.Очистить();
		ЗаполнитьТаблицуСерийДляПеремаркировкиНаСервере();
		ЗаполнитьТаблицуДокументыПеремаркировкиНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры				

&НаСервере
Процедура СоздатьДокументыПеремаркировкиНаСервере()
	
	ЗонаОтгрузки = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СкладскиеЯчейки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
	|ГДЕ
	|	СкладскиеЯчейки.Владелец = &Склад
	|	И СкладскиеЯчейки.ТипСкладскойЯчейки = ЗНАЧЕНИЕ(Перечисление.ТипыСкладскихЯчеек.ОтгрузкаУчетОстатков)";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗонаОтгрузки = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	ЗонаПриемки = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СкладскиеЯчейки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
	|ГДЕ
	|	СкладскиеЯчейки.Владелец = &Склад
	|	И СкладскиеЯчейки.ТипСкладскойЯчейки = ЗНАЧЕНИЕ(Перечисление.ТипыСкладскихЯчеек.Приемка)";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗонаПриемки = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	МассивСозданныхДокументов = Новый Массив;
	
	МассивНовыхСерий = Новый Массив;
	
	Для Каждого СтрокаТЧ Из СерииДляПеремаркировки Цикл
		
		Если СтрокаТЧ.Отметка Тогда
			
			НоваяСерия = СтрокаТЧ.Серия.Скопировать();
			НоваяСерия.бит_Перемаркировка = Истина;
			
			МаксимальныйНомерИзСправочника = Справочники.СерииНоменклатуры.ВычислитьМаксимальныйНомерСерии(СтрокаТЧ.Серия.ВидНоменклатуры);
			МаксимальныйНомерИзСправочника = МаксимальныйНомерИзСправочника + 1;
			НоваяСерия.Номер                   = Формат(МаксимальныйНомерИзСправочника, "ЧЦ=8; ЧВН=; ЧГ=");

			НоваяСерия.Записать();
			
			СтруктураСерии = Новый Структура;
			СтруктураСерии.Вставить("НоваяСерия", НоваяСерия.Ссылка);
			СтруктураСерии.Вставить("СтараяСерия", СтрокаТЧ.Серия);
			СтруктураСерии.Вставить("Количество", СтрокаТЧ.Количество); 
			СтруктураСерии.Вставить("Назначение", СтрокаТЧ.Назначение);

			МассивНовыхСерий.Добавить(СтруктураСерии);
						
		КонецЕсли;
		
	КонецЦикла;
	
	НовыйДокументПроизводствоБезЗаказа = Документы.ПроизводствоБезЗаказа.СоздатьДокумент();
	НовыйДокументПроизводствоБезЗаказа.Дата = ТекущаяДатаСеанса();
	НовыйДокументПроизводствоБезЗаказа.Организация = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ОрганизацияПоУмолчанию, ЭтотОбъект, Истина);
	НовыйДокументПроизводствоБезЗаказа.Подразделение = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ПодразделениеПеремаркировки, ЭтотОбъект, Истина);
	НовыйДокументПроизводствоБезЗаказа.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВПроизводствеБезЗаказа.ПоПродукции;
	НовыйДокументПроизводствоБезЗаказа.бит_Перемаркировка = Истина;
	
	НомерГруппыЗатрат = 0;
	
	Для Каждого ЭлМассива Из МассивНовыхСерий Цикл
		
		НомерГруппыЗатрат = НомерГруппыЗатрат + 1;
		
		СтрокаПродукции = НовыйДокументПроизводствоБезЗаказа.ВыходныеИзделия.Добавить();
		СтрокаПродукции.НомерГруппыЗатрат = НомерГруппыЗатрат;
		СтрокаПродукции.Номенклатура = НоваяНоменклатура;
		СтрокаПродукции.Серия = ЭлМассива.НоваяСерия;
		СтрокаПродукции.Назначение = НовоеНазначение;
		СтрокаПродукции.Количество = ЭлМассива.Количество;
		СтрокаПродукции.КоличествоУпаковок = ЭлМассива.Количество;
		СтрокаПродукции.Упаковка = НоваяНоменклатура.ЕдиницаИзмерения;
		СтрокаПродукции.НаправлениеВыпуска = Перечисления.ХозяйственныеОперации.ВыпускПродукцииНаСклад;
		СтрокаПродукции.Получатель = Склад;
		
		СтрокаМатериалы = НовыйДокументПроизводствоБезЗаказа.МатериалыИРаботы.Добавить();
		СтрокаМатериалы.Номенклатура = Номенклатура;
		СтрокаМатериалы.Серия = ЭлМассива.СтараяСерия;
		СтрокаМатериалы.Назначение = ЭлМассива.Назначение;
		СтрокаМатериалы.Количество = ЭлМассива.Количество;
		СтрокаМатериалы.КоличествоУпаковок = ЭлМассива.Количество;
		СтрокаМатериалы.Упаковка = Номенклатура.ЕдиницаИзмерения;
		СтрокаМатериалы.Склад = Склад;
		СтрокаМатериалы.Подразделение = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ПодразделениеПеремаркировки, ЭтотОбъект, Истина);
	    СтрокаМатериалы.СтатьяКалькуляции = Справочники.СтатьиКалькуляции.НайтиПоНаименованию("Материал");
		СтрокаМатериалы.НомерГруппыЗатрат = НомерГруппыЗатрат;
		
	КонецЦикла;
	
	ПараметрыУказанияСерий =
		НоменклатураСервер.ПараметрыУказанияСерий(НовыйДокументПроизводствоБезЗаказа, Документы.ПроизводствоБезЗаказа);
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(НовыйДокументПроизводствоБезЗаказа, ПараметрыУказанияСерий["ВыходныеИзделия"]);
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(НовыйДокументПроизводствоБезЗаказа, ПараметрыУказанияСерий["МатериалыИРаботы"]);
	
	НовыйДокументПроизводствоБезЗаказа.Записать(РежимЗаписиДокумента.Проведение);
	
	МассивСозданныхДокументов.Добавить(НовыйДокументПроизводствоБезЗаказа.Ссылка);
	
	ПараметрыПереоформленияРасходныхОрдеров = СкладыСервер.ПараметрыПереоформленияРасходныхОрдеров();
	ПараметрыПереоформленияРасходныхОрдеров.Получатель = НовыйДокументПроизводствоБезЗаказа.Подразделение;
	ПараметрыПереоформленияРасходныхОрдеров.РаспоряженияНаОтгрузку.Добавить(НовыйДокументПроизводствоБезЗаказа.Ссылка);
	ПараметрыПереоформленияРасходныхОрдеров.Склад = Склад;
	
	СтруктураЗадания = СкладыСервер.ПереоформитьРасходныеОрдера(ПараметрыПереоформленияРасходныхОрдеров);
	
	Для Каждого ОформленныеОрдераСтрока Из СтруктураЗадания.ОформленныеОрдера Цикл
		
		ОформленныеОрдераОбъект = ОформленныеОрдераСтрока.РасходныйОрдер.ПолучитьОбъект();
		ОформленныеОрдераОбъект.Дата = НовыйДокументПроизводствоБезЗаказа.Дата + 1;
		ОформленныеОрдераОбъект.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтгрузке;
		ОформленныеОрдераОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка КАК Ссылка,
		|	РасходныйОрдерНаТоварыОтгружаемыеТовары.НомерСтроки КАК НомерСтроки,
		|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Номенклатура КАК Номенклатура,
		|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Характеристика КАК Характеристика,
		|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Назначение КАК Назначение,
		|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Серия КАК Серия,
		|	РасходныйОрдерНаТоварыОтгружаемыеТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	РасходныйОрдерНаТоварыОтгружаемыеТовары.ЭтоУпаковочныйЛист КАК ЭтоУпаковочныйЛист,
		|	РасходныйОрдерНаТоварыОтгружаемыеТовары.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста КАК ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста,
		|	РасходныйОрдерНаТоварыОтгружаемыеТовары.УпаковочныйЛистРодитель КАК УпаковочныйЛистРодитель,
		|	РасходныйОрдерНаТоварыОтгружаемыеТовары.УпаковочныйЛист КАК УпаковочныйЛист,
		|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Упаковка КАК Упаковка,
		|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Количество КАК Количество,
		|	РасходныйОрдерНаТоварыОтгружаемыеТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Действие КАК Действие
		|ПОМЕСТИТЬ вт_РасходныйОрдер
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК РасходныйОрдерНаТоварыОтгружаемыеТовары
		|ГДЕ
		|	РасходныйОрдерНаТоварыОтгружаемыеТовары.Ссылка = &РасходныйОрдерСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПроизводствоБезЗаказаМатериалыИРаботы.Номенклатура КАК Номенклатура,
		|	ПроизводствоБезЗаказаМатериалыИРаботы.Характеристика КАК Характеристика,
		|	ПроизводствоБезЗаказаМатериалыИРаботы.Назначение КАК Назначение,
		|	ПроизводствоБезЗаказаМатериалыИРаботы.Серия КАК Серия,
		|	ПроизводствоБезЗаказаМатериалыИРаботы.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ПроизводствоБезЗаказаВыходныеИзделия.Номенклатура КАК НоваяНоменклатура,
		|	ПроизводствоБезЗаказаВыходныеИзделия.Серия КАК НоваяСерия,
		|	ПроизводствоБезЗаказаВыходныеИзделия.Назначение КАК НовоеНазначение
		|ПОМЕСТИТЬ вт_Товары
		|ИЗ
		|	Документ.ПроизводствоБезЗаказа.МатериалыИРаботы КАК ПроизводствоБезЗаказаМатериалыИРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ПроизводствоБезЗаказаВыходныеИзделия
		|		ПО ПроизводствоБезЗаказаВыходныеИзделия.НомерСтроки = ПроизводствоБезЗаказаМатериалыИРаботы.НомерСтроки
		|ГДЕ
		|	ПроизводствоБезЗаказаВыходныеИзделия.Ссылка = &Ссылка
		|	И ПроизводствоБезЗаказаМатериалыИРаботы.Ссылка = &Ссылка
		|	И (ПроизводствоБезЗаказаМатериалыИРаботы.Номенклатура, ПроизводствоБезЗаказаМатериалыИРаботы.Характеристика, ПроизводствоБезЗаказаМатериалыИРаботы.Назначение, ПроизводствоБезЗаказаМатериалыИРаботы.Серия) В
		|			(ВЫБРАТЬ
		|				вт_РасходныйОрдер.Номенклатура КАК Номенклатура,
		|				вт_РасходныйОрдер.Характеристика КАК Характеристика,
		|				вт_РасходныйОрдер.Назначение КАК Назначение,
		|				вт_РасходныйОрдер.Серия КАК Серия
		|			ИЗ
		|				вт_РасходныйОрдер КАК вт_РасходныйОрдер)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Товары.Номенклатура КАК Номенклатура,
		|	вт_Товары.Характеристика КАК Характеристика,
		|	вт_Товары.Серия КАК Серия,
		|	вт_Товары.Назначение КАК Назначение,
		|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК Количество,
		|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК КоличествоУпаковок,
		|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК КоличествоОтобрано,
		|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК КоличествоУпаковокОтобрано, 
		|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК КоличествоРазмещено,
		|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК КоличествоУпаковокРазмещено,

		|	вт_Товары.НоваяНоменклатура КАК НоваяНоменклатура,
		|	вт_Товары.НоваяСерия КАК НоваяСерия,
		|	вт_Товары.НовоеНазначение КАК НовоеНазначение,
		|	ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка
		|ИЗ
		|	вт_Товары КАК вт_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(&Дата, ) КАК ТоварыВЯчейкахОстатки
		|		ПО вт_Товары.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
		|			И вт_Товары.Характеристика = ТоварыВЯчейкахОстатки.Характеристика
		|			И вт_Товары.Назначение = ТоварыВЯчейкахОстатки.Назначение
		|			И вт_Товары.Серия = ТоварыВЯчейкахОстатки.Серия
		|ИТОГИ ПО
		|	Ячейка";
		
		Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("Ссылка", НовыйДокументПроизводствоБезЗаказа.Ссылка);
		Запрос.УстановитьПараметр("РасходныйОрдерСсылка", ОформленныеОрдераСтрока.РасходныйОрдер.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаЯчейка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаЯчейка.Следующий() Цикл
			
			НовыйДокументОтбор = Документы.ОтборРазмещениеТоваров.СоздатьДокумент();
			НовыйДокументОтбор.Дата = НовыйДокументПроизводствоБезЗаказа.Дата + 2;
			НовыйДокументОтбор.Заполнить(ОформленныеОрдераСтрока.РасходныйОрдер.Ссылка);
			НовыйДокументОтбор.ЗонаОтгрузки = ЗонаОтгрузки;
			//НовыйДокументОтбор.Записать();
			
			ВыборкаДетальныеЗаписи = ВыборкаЯчейка.Выбрать();
			НовыйДокументОтбор.ТоварыОтбор.Очистить();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				СтрокаОтбор = НовыйДокументОтбор.ТоварыОтбор.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаОтбор, ВыборкаДетальныеЗаписи);
			КонецЦикла;
			
			ПараметрыУказанияСерий =
				НоменклатураСервер.ПараметрыУказанияСерий(НовыйДокументОтбор, Документы.ОтборРазмещениеТоваров);
			
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(НовыйДокументОтбор, ПараметрыУказанияСерий["Отбор"]);
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(НовыйДокументОтбор, ПараметрыУказанияСерий["Размещение"]);
			
			НовыйДокументОтбор.Записать();
			
			НовыйДокументОтбор.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.ВРаботе;
			НовыйДокументОтбор.Записать(РежимЗаписиДокумента.Проведение);
			НовыйДокументОтбор.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.ВыполненоБезОшибок;
			НовыйДокументОтбор.Дата = ОформленныеОрдераОбъект.Дата + 1;
			НовыйДокументОтбор.Записать(РежимЗаписиДокумента.Проведение);
			
			МассивСозданныхДокументов.Добавить(НовыйДокументОтбор.Ссылка);
						
			НовыйДокументПриходныйОрдер = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
			
			НовыйДокументПриходныйОрдер.Заполнить(НовыйДокументПроизводствоБезЗаказа);
			
			НовыйДокументПриходныйОрдер.Дата = НовыйДокументПроизводствоБезЗаказа.Дата + 3;
			НовыйДокументПриходныйОрдер.Склад = Склад;
			НовыйДокументПриходныйОрдер.СкладскаяОперация = Перечисления.СкладскиеОперации.ПриемкаПродукцииИзПроизводства;
			НовыйДокументПриходныйОрдер.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаПродукцииИзПроизводства;
			НовыйДокументПриходныйОрдер.Распоряжение = НовыйДокументПроизводствоБезЗаказа.Ссылка;
			НовыйДокументПриходныйОрдер.Отправитель = НовыйДокументПроизводствоБезЗаказа.Подразделение;
			НовыйДокументПриходныйОрдер.Помещение = НовыйДокументОтбор.Помещение;
			НовыйДокументПриходныйОрдер.ЗонаПриемки = ЗонаПриемки;
			
			ВыборкаДетальныеЗаписи.Сбросить();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				СтрокаТовары = НовыйДокументПриходныйОрдер.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТовары, ВыборкаДетальныеЗаписи);
				СтрокаТовары.Номенклатура = ВыборкаДетальныеЗаписи.НоваяНоменклатура;
				СтрокаТовары.Серия = ВыборкаДетальныеЗаписи.НоваяСерия;
				СтрокаТовары.Назначение = ВыборкаДетальныеЗаписи.НовоеНазначение;
			КонецЦикла;
			
			ПараметрыУказанияСерий =
			НоменклатураСервер.ПараметрыУказанияСерий(НовыйДокументПриходныйОрдер, Документы.ПриходныйОрдерНаТовары);
			//
			//НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(НовыйДокументПриходныйОрдер, ПараметрыУказанияСерий["Товары"]);
			
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(НовыйДокументПриходныйОрдер, ПараметрыУказанияСерий);
			
			НовыйДокументПриходныйОрдер.Статус = Перечисления.СтатусыПриходныхОрдеров.КПоступлению;
			НовыйДокументПриходныйОрдер.Записать(РежимЗаписиДокумента.Проведение);
			НовыйДокументПриходныйОрдер.Статус = Перечисления.СтатусыПриходныхОрдеров.ВРаботе;
			НовыйДокументПриходныйОрдер.Записать(РежимЗаписиДокумента.Проведение);
			НовыйДокументПриходныйОрдер.Статус = Перечисления.СтатусыПриходныхОрдеров.ТребуетсяОбработка;
			НовыйДокументПриходныйОрдер.Записать(РежимЗаписиДокумента.Проведение);
			
			
			//НовыйДокументПриходныйОрдер.ЗонаПриемки = НовыйДокументОтбор.ЗонаПриемки;
			НовыйДокументПриходныйОрдер.Статус = Перечисления.СтатусыПриходныхОрдеров.Принят;
			НовыйДокументПриходныйОрдер.Записать(РежимЗаписиДокумента.Проведение);
			
			МассивСозданныхДокументов.Добавить(НовыйДокументПриходныйОрдер.Ссылка);
			
			НовыйДокументОтбор = Документы.ОтборРазмещениеТоваров.СоздатьДокумент();
			НовыйДокументОтбор.Дата = НовыйДокументПроизводствоБезЗаказа.Дата + 4;
			НовыйДокументОтбор.Заполнить(НовыйДокументПриходныйОрдер.Ссылка);
			НовыйДокументОтбор.бит_ПроизводствоБезЗаказа = НовыйДокументПроизводствоБезЗаказа.Ссылка;
						
			Для Каждого СтрокаРазмещение Из НовыйДокументОтбор.ТоварыРазмещение Цикл
				СтрокаРазмещение.Ячейка = НовыйДокументОтбор.ЗонаПриемки;
			КонецЦикла;
			
			НовыйДокументОтбор.РазместитьТовары("ТоварыРазмещение");
			
			ПараметрыУказанияСерий =
				НоменклатураСервер.ПараметрыУказанияСерий(НовыйДокументОтбор, Документы.ОтборРазмещениеТоваров);
			
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(НовыйДокументОтбор, ПараметрыУказанияСерий["Отбор"]);
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(НовыйДокументОтбор, ПараметрыУказанияСерий["Размещение"]);
			
			НовыйДокументОтбор.ЗонаПриемки = ЗонаПриемки;
			
			НовыйДокументОтбор.Записать();
			
			НовыйДокументОтбор.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.ВРаботе;
			НовыйДокументОтбор.Записать(РежимЗаписиДокумента.Проведение);
			НовыйДокументОтбор.Статус = Перечисления.СтатусыОтборовРазмещенийТоваров.ВыполненоБезОшибок;
			НовыйДокументОтбор.Записать(РежимЗаписиДокумента.Проведение);
			
			МассивСозданныхДокументов.Добавить(НовыйДокументОтбор.Ссылка);
				
		КонецЦикла;	
		
		ОформленныеОрдераОбъект.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен;
		Для Каждого СтрокаТЧ Из ОформленныеОрдераОбъект.ОтгружаемыеТовары Цикл
			СтрокаТЧ.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить;
		КонецЦикла;
		ОформленныеОрдераОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		МассивСозданныхДокументов.Добавить(ОформленныеОрдераСтрока.РасходныйОрдер.Ссылка);
		
	КонецЦикла;
							
	СкладскиеДокументы.Очистить();
	
	Для Каждого ЭлМассива Из МассивСозданныхДокументов Цикл
		НоваяСтрока = СкладскиеДокументы.Добавить();
		НоваяСтрока.ДокументСсылка = ЭлМассива.Ссылка;
	КонецЦикла;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаСформированиыеДокументы;
	
КонецПроцедуры

&НаКлиенте
Процедура СерииДляПеремаркировкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено
		И Поле.Имя = "СерииДляПеремаркировкиСерия" Тогда 
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Серия);
		
		ОткрытьФорму("Справочник.СерииНоменклатуры.Форма.ФормаЭлемента", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СерииДляПеремаркировкиОтметкаПриИзменении(Элемент)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Отметка", Истина);
	
	ИтогоВыбрано = 0;
	
	НайденныеСтроки = СерииДляПеремаркировки.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого СтрокаТЗ Из НайденныеСтроки Цикл
		ИтогоВыбрано = ИтогоВыбрано + СтрокаТЗ.Количество;
	КонецЦикла;
	
	

КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовПеремаркировкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено
		И Поле.Имя = "СписокДокументовПеремаркировкиДокументСсылка" Тогда 
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.ДокументСсылка);
		
		ОткрытьФорму("Документ.ПроизводствоБезЗаказа.Форма.ФормаДокумента", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьПеремаркировку(Команда)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаСерииДляПеремаркировки;
КонецПроцедуры

&НаКлиенте
Процедура СкладскиеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено
		И Поле.Имя = "СкладскиеДокументыДокументСсылка" Тогда 
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.ДокументСсылка);
		
		Если ТипЗнч(ТекущиеДанные.ДокументСсылка) = Тип("ДокументСсылка.ПроизводствоБезЗаказа") Тогда
			ОткрытьФорму("Документ.ПроизводствоБезЗаказа.Форма.ФормаДокумента", ПараметрыФормы);
		ИначеЕсли ТипЗнч(ТекущиеДанные.ДокументСсылка) = Тип("ДокументСсылка.ОтборРазмещениеТоваров") Тогда
			ОткрытьФорму("Документ.ОтборРазмещениеТоваров.Форма.ФормаДокумента", ПараметрыФормы);
		ИначеЕсли ТипЗнч(ТекущиеДанные.ДокументСсылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда
			ОткрытьФорму("Документ.РасходныйОрдерНаТовары.Форма.ФормаДокумента", ПараметрыФормы);
		ИначеЕсли ТипЗнч(ТекущиеДанные.ДокументСсылка) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") Тогда
			ОткрытьФорму("Документ.ПриходныйОрдерНаТовары.Форма.ФормаДокумента", ПараметрыФормы);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЭтикеток(Команда)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "СтраницаСерииДляПеремаркировки" Тогда
		ТекущиеДанные = Элементы.СписокДокументовПеремаркировки.ТекущиеДанные;
	Иначе	
		ТекущиеДанные = Элементы.СкладскиеДокументы.ТекущиеДанные;
	КонецЕсли;                                                                
	
	Если ТекущиеДанные <> Неопределено 
		И ТипЗнч(ТекущиеДанные.ДокументСсылка) = Тип("ДокументСсылка.ПроизводствоБезЗаказа") Тогда
	
		мСтрок = ПолучитьСтруктуруСтрок(ТекущиеДанные.ДокументСсылка);
		
		Если мСтрок.Количество() Тогда
			АдресТаблицы = СформироватьДанныеДляПечатиЭтикеток(мСтрок, ТекущиеДанные.ДокументСсылка);
			Если АдресТаблицы <> Неопределено Тогда                   
				ОткрытьФормуПечати(АдресТаблицы);
			КонецЕсли;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для печати");
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьВесовыхЭтикеток(Команда)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "СтраницаСерииДляПеремаркировки" Тогда
		ТекущиеДанные = Элементы.СписокДокументовПеремаркировки.ТекущиеДанные;
	Иначе	
		ТекущиеДанные = Элементы.СкладскиеДокументы.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущиеДанные <> Неопределено 
		И ТипЗнч(ТекущиеДанные.ДокументСсылка) = Тип("ДокументСсылка.ПроизводствоБезЗаказа") Тогда
	
		мСтрок = ПолучитьСтруктуруСтрок(ТекущиеДанные.ДокументСсылка);
		
		Если мСтрок.Количество() Тогда
			АдресТаблицы = СформироватьДанныеДляПечатиВесовыхЭтикеток(мСтрок, ТекущиеДанные.ДокументСсылка);
			Если АдресТаблицы <> Неопределено Тогда                   
				ОткрытьФормуПечатиВесовыхЭтикеток(АдресТаблицы);
			КонецЕсли;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для печати");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЛистаПеремаркировки(Команда)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "СтраницаСерииДляПеремаркировки" Тогда
		ТекущиеДанные = Элементы.СписокДокументовПеремаркировки.ТекущиеДанные;
	Иначе	
		ТекущиеДанные = Элементы.СкладскиеДокументы.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущиеДанные <> Неопределено 
		И ТипЗнч(ТекущиеДанные.ДокументСсылка) = Тип("ДокументСсылка.ПроизводствоБезЗаказа") Тогда
		
		ТабличныйДокумент = СформироватьПечатьЛистаПеремаркировкиНаСервере(ТекущиеДанные.ДокументСсылка);
		
		КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ЛистПеремаркировки");
		КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
		КоллекцияПечатныхФорм[0].Экземпляров = 1;
		КоллекцияПечатныхФорм[0].СинонимМакета = "ЛистПеремаркировки";  // используется для формирования имени файла при сохранении из общей формы печати документов
		УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьПечатьЛистаПеремаркировкиНаСервере(ДокументСсылка)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Обрабаботка = РеквизитФормыВЗначение("Объект");
	
	Макет = Обрабаботка.ПолучитьМакет("МакетЛистПеремаркировки");
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("ОбластьСтрокаТаблицы");
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	
	ОбластьШапка.Параметры.Организация = ДокументСсылка.Организация;	
	ОбластьШапка.Параметры.НомерДатаДокумента = ДокументСсылка.Номер + " от " + Формат(ДокументСсылка.Дата, "ДФ='dd.MM.yyyy ""г.""'");
	ОбластьШапка.Параметры.Подразделение = ДокументСсылка.Подразделение;
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МатериалыИРаботы.НомерСтроки КАК НомерСтроки,
		|	МатериалыИРаботы.Номенклатура КАК НоменклатураДляПеремаркировки,
		|	МатериалыИРаботы.Серия КАК СерияДляПеремаркировки,
		|	ОтборРазмещениеТоваровТоварыОтбор.Ячейка КАК ЯчейкаОтбора,
		|	ВыходныеИзделия.Номенклатура КАК НоваяНоменклатура,
		|	ВыходныеИзделия.Серия КАК НоваяСерия,
		|	ОтборРазмещениеТоваровТоварыРазмещение.Ячейка КАК ЯчейкаРазмещения,
		|	МатериалыИРаботы.Серия.бит_ТипТары КАК Тара,
		|	МатериалыИРаботы.КоличествоУпаковок КАК Количество,
		|	МатериалыИРаботы.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	Документ.ПроизводствоБезЗаказа.МатериалыИРаботы КАК МатериалыИРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ВыходныеИзделия
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтборРазмещениеТоваров.ТоварыРазмещение КАК ОтборРазмещениеТоваровТоварыРазмещение
		|			ПО ВыходныеИзделия.Ссылка = ОтборРазмещениеТоваровТоварыРазмещение.Ссылка.бит_ПроизводствоБезЗаказа
		|				И ВыходныеИзделия.Номенклатура = ОтборРазмещениеТоваровТоварыРазмещение.Номенклатура
		|				И ВыходныеИзделия.Серия = ОтборРазмещениеТоваровТоварыРазмещение.Серия
		|		ПО МатериалыИРаботы.Ссылка = ВыходныеИзделия.Ссылка
		|			И МатериалыИРаботы.НомерСтроки = ВыходныеИзделия.НомерСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТовары
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтборРазмещениеТоваров.ТоварыОтбор КАК ОтборРазмещениеТоваровТоварыОтбор
		|			ПО РасходныйОрдерНаТоварыТовары.Ссылка = ОтборРазмещениеТоваровТоварыОтбор.Ссылка.Распоряжение
		|				И РасходныйОрдерНаТоварыТовары.Номенклатура = ОтборРазмещениеТоваровТоварыОтбор.Номенклатура
		|				И РасходныйОрдерНаТоварыТовары.Серия = ОтборРазмещениеТоваровТоварыОтбор.Серия
		|		ПО МатериалыИРаботы.Ссылка = РасходныйОрдерНаТоварыТовары.Распоряжение
		|			И МатериалыИРаботы.Номенклатура = РасходныйОрдерНаТоварыТовары.Номенклатура
		|			И МатериалыИРаботы.Серия = РасходныйОрдерНаТоварыТовары.Серия
		|ГДЕ
		|	ВыходныеИзделия.Ссылка = &Ссылка
		|	И МатериалыИРаботы.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//ОбластьСтрокаТаблицы.Параметры.НомерСтроки = СтрокаМатериалы.НомерСтроки;
		//ОбластьСтрокаТаблицы.Параметры.НоменклатураДляПеремаркировки = СтрокаМатериалы.Номенклатура;
		//ОбластьСтрокаТаблицы.Параметры.СерияДляПеремаркировки = СтрокаМатериалы.Серия;
		//ОбластьСтрокаТаблицы.Параметры.НоваяНоменклатура = ДокументСсылка.ВыходныеИзделия[СтрокаМатериалы.НомерСтроки - 1].Номенклатура;
		//ОбластьСтрокаТаблицы.Параметры.НоваяСерия = ДокументСсылка.ВыходныеИзделия[СтрокаМатериалы.НомерСтроки - 1].Серия;
		//ОбластьСтрокаТаблицы.Параметры.Тара = СтрокаМатериалы.Серия.бит_ТипТары;
		//ОбластьСтрокаТаблицы.Параметры.Количество = СтрокаМатериалы.КоличествоУпаковок;
		//ОбластьСтрокаТаблицы.Параметры.ЕдиницаИзмерения = СтрокаМатериалы.Номенклатура.ЕдиницаИзмерения;
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицы.Параметры, ВыборкаДетальныеЗаписи);
		ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
	КонецЦикла;
		
	//Для Каждого СтрокаМатериалы Из ДокументСсылка.МатериалыИРаботы Цикл
	//	
	//	ОбластьСтрокаТаблицы.Параметры.НомерСтроки = СтрокаМатериалы.НомерСтроки;
	//	ОбластьСтрокаТаблицы.Параметры.НоменклатураДляПеремаркировки = СтрокаМатериалы.Номенклатура;
	//	ОбластьСтрокаТаблицы.Параметры.СерияДляПеремаркировки = СтрокаМатериалы.Серия;
	//	ОбластьСтрокаТаблицы.Параметры.НоваяНоменклатура = ДокументСсылка.ВыходныеИзделия[СтрокаМатериалы.НомерСтроки - 1].Номенклатура;
	//	ОбластьСтрокаТаблицы.Параметры.НоваяСерия = ДокументСсылка.ВыходныеИзделия[СтрокаМатериалы.НомерСтроки - 1].Серия;
	//	ОбластьСтрокаТаблицы.Параметры.Тара = СтрокаМатериалы.Серия.бит_ТипТары;
	//	ОбластьСтрокаТаблицы.Параметры.Количество = СтрокаМатериалы.КоличествоУпаковок;
	//	ОбластьСтрокаТаблицы.Параметры.ЕдиницаИзмерения = СтрокаМатериалы.Номенклатура.ЕдиницаИзмерения;
	//	
	//	ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
	//	
	//КонецЦикла;
		
	ОбластьПодвал.Параметры.ТекстИтого = "Итого серий " + ДокументСсылка.МатериалыИРаботы.Количество() + " штуки," + ДокументСсылка.МатериалыИРаботы.Итог("КоличествоУпаковок") + " " + ДокументСсылка.МатериалыИРаботы[0].Номенклатура.ЕдиницаИзмерения;
	
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабличныйДокумент;

КонецФункции

&НаСервере
Функция ПолучитьСтруктуруСтрок(ДокументСсылка)
	
	мСтрок = Новый Массив;	
	
	Для Каждого СтрокаТЧ Из ДокументСсылка.ВыходныеИзделия Цикл
		
		//Если Не ЗначениеЗаполнено(СтрокаТЧ.Серия) Тогда
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена серия в строке " + СтрокаТЧ.НомерСтроки);
		//	Продолжить;
		//КонецЕсли;
		//Если Не ЗначениеЗаполнено(СтрокаТЧ.бит_Тара) Тогда
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена тара в строке " + СтрокаТЧ.НомерСтроки);
		//	Продолжить;
		//КонецЕсли;
		
		//ТД = Элементы.ВыходныеИзделия.ДанныеСтроки(СтрокаТЧ);
		Структура = Новый Структура;
		Структура.Вставить("Номенклатура", СтрокаТЧ.Номенклатура);
		Структура.Вставить("Серия",СтрокаТЧ.Серия);
		Структура.Вставить("Тара", СтрокаТЧ.бит_Тара);
		Структура.Вставить("Спецификация", СтрокаТЧ.Спецификация); 
		Структура.Вставить("ВидРабочегоЦентра", СтрокаТЧ.Серия.бит_ВидРабочегоЦентра);
		Структура.Вставить("МассаНеттоКГ", СтрокаТЧ.Количество);
		Структура.Вставить("ШтампЭмалировщика", СтрокаТЧ.Серия.бит_Эмалировщик.Код);
		Структура.Вставить("ШтампКонтролера", СтрокаТЧ.бит_ШтампКонтролера);
		Структура.Вставить("Смена", СтрокаТЧ.Серия.бит_Смена);
		Структура.Вставить("Дата", СтрокаТЧ.Серия.ДатаПроизводства);
			
		мСтрок.Добавить(Структура);
		
	КонецЦикла;	
	
	Возврат мСтрок
	
КонецФункции

&НаСервере
Функция СформироватьДанныеДляПечатиЭтикеток(мСтрок, ДокументСсылка)
	
	Возврат Документы.ПроизводствоБезЗаказа.СформироватьДанныеДляПечатиЭтикеток(мСтрок)	

КонецФункции

&НаСервере
Функция СформироватьДанныеДляПечатиВесовыхЭтикеток(мСтрок, ДокументСсылка)
	
	Возврат Документы.ПроизводствоБезЗаказа.СформироватьДанныеДляПечатиВесовыхЭтикеток(мСтрок)	

КонецФункции

&НаКлиенте
Процедура ОткрытьФормуПечати(Адрес)
// {{ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [27.11.2025 22:37:17] +        
	ПараметрыОткрытия = Новый Структура; 
	ПараметрыОткрытия.Вставить("ВладелецФормы");
	ПараметрыОткрытия.Вставить("ИменаМакетов", "бит_ЭтикеткаТовары");		
	ПараметрыОткрытия.Вставить("ИмяМенеджераПечати", "Обработка.ПечатьЭтикетокИЦенников");
	ПараметрыОткрытия.Вставить("ИсточникДанных");
	ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм");
	ПараметрыОткрытия.Вставить("ОбъектыПечати", Новый СписокЗначений);
	МассивПараметрКоманды = новый Массив;
	МассивПараметрКоманды.Добавить(ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	ПараметрыОткрытия.Вставить("ПараметрКоманды", МассивПараметрКоманды);
	ПараметрыОткрытия.Вставить("ПараметрыВывода"); 
	ПараметрыОткрытия.Вставить("ПараметрыИсточника");
	СтруктураПараметрыПечати = Новый Структура;
	СтруктураПараметрыПечати.Вставить("ВидЦены", ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
	СтруктураПараметрыПечати.Вставить("ВидЦеныДополнительно", ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
	СтруктураПараметрыПечати.Вставить("Дата", ТекущаяДата());
	СтруктураПараметрыПечати.Вставить("ДатаДополнительно", ТекущаяДата());
	СтруктураПараметрыПечати.Вставить("МаксимальныйКодВесовогоТовара", 99999);
	СтруктураПараметрыПечати.Вставить("Организация");
	СтруктураПараметрыПечати.Вставить("ПравилоВыгрузкиВВесы", Ложь);
	СтруктураПараметрыПечати.Вставить("ПравилоОбмена");
	СтруктураПараметрыПечати.Вставить("Склад");
	СтруктураПараметрыПечати.Вставить("СтранаРегистрации", ПредопределенноеЗначение("Справочник.СтраныМира.Россия"));
	СтруктураПараметрыПечати.Вставить("СтруктураМакетаШаблона");
	СтруктураПараметрыПечати.Вставить("Товары", Адрес);
	
	ПараметрыОткрытия.Вставить("ПараметрыПечати", СтруктураПараметрыПечати);
	ПараметрыОткрытия.Вставить("ТекущийЯзык");
	ПараметрыОткрытия.Вставить("УникальныйИдентификаторХранилища");
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ЭтаФорма, Строка(Новый УникальныйИдентификатор));
// }}ПервыйБИТ ЛистТребований [исправления после сквозного]  [VUVaynula@1cbit.ru] [27.11.2025 22:37:17] -	
КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьФормуПечатиВесовыхЭтикеток(Адрес)
// {{ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [27.11.2025 22:37:17] +        
	ПараметрыОткрытия = Новый Структура; 
	ПараметрыОткрытия.Вставить("ВладелецФормы");
	ПараметрыОткрытия.Вставить("ИменаМакетов", "ЭтикеткаТовары");		
	ПараметрыОткрытия.Вставить("ИмяМенеджераПечати", "Обработка.ПечатьЭтикетокИЦенников");
	ПараметрыОткрытия.Вставить("ИсточникДанных");
	ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм");
	ПараметрыОткрытия.Вставить("ОбъектыПечати", Новый СписокЗначений);
	МассивПараметрКоманды = новый Массив;
	МассивПараметрКоманды.Добавить(ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	ПараметрыОткрытия.Вставить("ПараметрКоманды", МассивПараметрКоманды);
	ПараметрыОткрытия.Вставить("ПараметрыВывода"); 
	ПараметрыОткрытия.Вставить("ПараметрыИсточника");
	СтруктураПараметрыПечати = Новый Структура;
	СтруктураПараметрыПечати.Вставить("ВидЦены", ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
	СтруктураПараметрыПечати.Вставить("ВидЦеныДополнительно", ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
	СтруктураПараметрыПечати.Вставить("Дата", ТекущаяДата());
	СтруктураПараметрыПечати.Вставить("ДатаДополнительно", ТекущаяДата());
	СтруктураПараметрыПечати.Вставить("МаксимальныйКодВесовогоТовара", 99999);
	СтруктураПараметрыПечати.Вставить("Организация");
	СтруктураПараметрыПечати.Вставить("ПравилоВыгрузкиВВесы", Ложь);
	СтруктураПараметрыПечати.Вставить("ПравилоОбмена");
	СтруктураПараметрыПечати.Вставить("Склад");
	СтруктураПараметрыПечати.Вставить("СтранаРегистрации", ПредопределенноеЗначение("Справочник.СтраныМира.Россия"));
	СтруктураПараметрыПечати.Вставить("СтруктураМакетаШаблона");
	СтруктураПараметрыПечати.Вставить("Товары", Адрес);
	
	
	ПараметрыОткрытия.Вставить("ПараметрыПечати", СтруктураПараметрыПечати);
	ПараметрыОткрытия.Вставить("ТекущийЯзык");
	ПараметрыОткрытия.Вставить("УникальныйИдентификаторХранилища");
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ЭтаФорма, Строка(Новый УникальныйИдентификатор));
// }}ПервыйБИТ ЛистТребований [ЛТ5.30]  [VUVaynula@1cbit.ru] [27.11.2025 22:37:17] -	
КонецПроцедуры
